Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/forsvaret.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: have general knowledge of the procedure in a research process.
nb: ha generell kunnskap om fremgangsmåten i en forskningsprosess.

source: The purpose of the course is to provide the students with knowledge and understanding of their role as a cyber engineer by developing English oral and written language skills as a basis for participation in international operations and collaboration in general, and in Communication and Information Systems (CIS) and the cyber domain in particular.
nb: Hensikten med emnet er å tilføre studentene kunnskap og forståelse for sin rolle som cyberingeniør gjennom å utvikle engelske språkferdigheter skriftlig og muntlig som grunnlag for tjeneste i internasjonale operasjoner og samarbeid generelt, og i Communication and Information Systems (CIS) og cyberdomenet spesielt.

source: For the Air Defense industry, the course is conducted at the Air Defense Tactical School (LVTS) on Ørland.
nb: For bransjen Luftvern gjennomføres emnet ved Luftverntaktisk skole (LVTS) på Ørland.

source: demonstrate broad knowledge of nautical topics that provide a holistic maritime perspective aimed at the Navy's requirements and the STCW Convention, as a basis for being awarded the maritime certificate of competency class 1 - deck officer (D1).
nb: bevise bred kjennskap til nautiske emner som gir et helhetlig maritimt perspektiv rettet mot Sjøforsvarets behov og STCW-konvensjonen, som danner grunnlaget for å løse ut maritimt sertifikat dekksoffiser klasse 1 (D1).

source: Plan and adapt physical training for yourself and the platoon in order to build the requisite resilience for international operations
nb: planlegge og tilrettelegge fysisk trening for seg selv og avdelingen for å bygge robusthet for internasjonale operasjoner

source: Understanding of management of different types of military Communication and Information (CIS)/cyber operations nationally and internationally
nb: Forståelse av ulike typer militære Communication and Information(CIS)-/cyberoperasjoner nasjonalt og internasjonalt

source: • demonstrate understanding of the digital engineering foundation for information and communication technology.
nb: • vise forståelse for det digitalteknologiske grunnlaget for informasjons- og kommunikasjonsteknologi

source: Use documentation and drawings.
nb: Bruke dokumentasjon og tegninger.

source: is built up of 5 different topics.
nb: bygges opp av 5 ulike temaer.

source: STCW Function: Control of the ship's operation and care for people on board at the operational level.
nb: er en lengre praksisperiode i eget våpen, og er ment å være en referanse for videre utdanning og utvikling på Forsvarets Høyskole.

source: In addition, time is set aside time for individual and collective feedback.
nb: Stridskurset avsluttes med individuell og lagsvis etterarbeid og refleksjon.

source: use methods, simulators, school vessels and other tools that form the basis for navigating and operating the Navy's vessels safely and effectively.
nb: anvende metoder, simulatorer, skolefartøy og annet verktøy som danner grunnlag for å navigere og operere Sjøforsvarets fartøyer sikkert og effektivt.

source: Compendium with selected texts within themes 1 and 2 (max 100 pages)
nb: Kompendium med utvalgte tekster innen tema 1 og 2 (maks 100 sider)

source: Liquid transport, sea, freshwater, ballast and cargo oil systems.
nb: Væsketransport, sjø-, ferskvann-, ballast- og lastoljesystemer.

source: Apply principles for logistics support to the Armed Forces’ operative units in peace, crisis and war domestically and in foreign operations.
nb: Anvende prinsipper for logistikkstøtte til Forsvarets operative enheter i fred, krise og krig nasjonalt, og i utenlandsoperasjoner.

source: The course provides knowledge on national preparedness from a Total Defence perspective as well as from the military and civilian perspective, including various approaches to a civilian emergency response system (SBS) and a military response system (BFF), in addition to coordination issues with associated political and legal challenges.
nb: Emnet gir kunnskap om nasjonal beredskap i et totalforsvarsperspektiv så vel som i det militære og det sivile perspektiv, herunder kommer ulike tilnærminger til et sivilt beredskapssystem (SBS) og et militært beredskapssystem (BFF), samt til samordningsproblematikk med tilhørende politiske og rettslige utfordringer.

source: Communicate military challenges and resolutions, both orally and in writing, in Norwegian and English.
nb: kommunisere militære problemstillinger og løsninger skriftlig og muntlig på norsk og engelsk.

source: Today, the UN deploys so-called multidimensional and integrated missions in complex civil war-like conflicts where there is no peace to keep, and where the degree of consent from the parties is low.
nb: I dag involveres FN med såkalte flerdimensjonale og integrerte misjoner i komplekse borgerkrigsliknende konflikter der det ikke er en fred å bevare, og der graden av samtykke er lav.

source: The cadets will gain an understanding of the personal conditions needed for leadership and the importance of individual differences for the participation in leadership processes.
nb: Kadettene skal få forståelse for personlige forutsetninger for ledelse og individuelle forskjellers betydning for deltakelsen i ledelsesprosesser.

source: Lectures, theory assignments, laboratory assignments and compulsory tests.
nb: Forelesninger, teorioppgaver, laboratorieoppgaver og obligatoriske tester.

source: the officer's ethical and legal freedoms to act.
nb: offiserens etiske og rettslige handlingsrom.

source: The purpose is for cadets to train in the roles of watch commander, captain and division commander on board Kvarven and Nordnes.
nb: Hensikten er å øve kadettene i rollen vaktsjef, skipssjef og divisjonssjef ombord Kvarven og Nordnes.

source: Is the vessel on the line of course or is it starboard or port of it?
nb: Ligger fartøyet i kurslinja eller er en til styrbord eller babord?

source: think and reason mathematically, that is, set up mathematical models, solve mathematical problems, both analytically and numerically, and evaluate and account for the results achieved
nb: tenke og resonnere matematisk, det vil si, stille opp matematiske modeller, løse matematiske problemer, både analytisk og numerisk, og vurdere og gjøre rede for resultatene som fremkommer

source: Lectures, theory assignments, laboratory assignments and compulsory assignments
nb: Forelesninger, teorioppgaver, laboratorieoppgaver og obligatoriske oppgaver

source: and the assignments and roles incorporated by the Norwegian Armed Forces as part of this.
nb: og hvilke oppgaver og roller Forsvaret har som del av dette.

source: read and understand operational documents, including OPORDERS, OPGEN, OPTASK and TABORDS
nb: lese og forstå operative dokumenter, herunder OPORDERS, OPGEN, OPTASK og TABORDS

source: knowledge of requirements, methods and tools for technical description and working drawings
nb: kjennskap til krav, metoder og verktøy for teknisk beskrivelse og arbeidstegninger

source: Section 2 addresses the historical development of the mutual influence between military power and the society it is part of.
nb: Del 2 tar for seg den historiske utviklingen av den gjensidige påvirkningen mellom militærmakten og det samfunnet den springer ut i fra.

source: The course is coordinated with the following courses and exercises: basic ECDIS and assistant courses, Sensor Systems, MPN 4, the Ryfylke and Blindleia exercises, the ARPA/AIS course and Watchkeeping and Vessel Control 1.
nb: Emnet er koordinert med emnene og øvelsene grunnlegende ECDIS- og assistenkurs, Sensorsystemer, MPN 4, Øvelsene Ryfylke og Blindleia, ARPA/AIS-kurset, og Brovakt og fartøyskontroll 1.

source: Work-, learn- and assessment methods
nb: Arbeids-, lærings-, og vurderingsformer

source: Compendium in English with selected news articles (about 20 pages).
nb: Kompendium i engelsk med utvalgte nyhetsartikler (ca. 20 sider).

source: How can military protect civilians from violence?
nb: Hvordan kan militære beskytte sivile fra vold?

source: • explain the principles of signal processing algorithms such as convolution, correlation, discrete Fourier transform (DFT) and fast Fourier transform (FFT)
nb: • forklare det prinsippielle ved signalbehandlingsalgoritmer som folding, korrelasjon, diskret fourier transform (DFT) og fast fourier transform (FFT)

source: Including storage, handling goods and class supplies.
nb: Herunder lagring, håndtering av gods og klasseforsyninger.

source: • describe key concepts, protocols and components in network security
nb: • beskrive sentrale begreper, protokoller og komponenter innen nettverkssikkerhet

source: Master relevant techniques and tools for conducting soil investigation in fields for the identification and classification of soil
nb: Beherske relevante tekniker og verktøy for å gjennomføre grunnundersøkelse i felt for identifisering og klassifisering av jord og løsmasser

source: The thesis must be delivered electronically in PDF format to the student administration.
nb: Masteroppgaven skal leveres elektronisk i PDF-format til studieadministrasjonen.

source: DFT (FFT) with emphasis on use.
nb: DFT (FFT) med vekt på bruken.

source: summarise safe management and operation of marine turbomachinery in simulator and in laboratory.
nb: gjengi sikker operering og drift av marine turbomaskiner på simulator og i laboratoriet.

source: Required reading (approx. 250 pages), obligatory assignment (essay), and assessment (revised essay) fall under MILM2405, but will be begun at the start of the semester.
nb: Pensum (ca. 250 sider), arbeidskrav (essay) og vurdering (revidert essay) tilfaller MILM2405, men vil implementert ved semesterets oppstart.

source: explain military and civilian vessel designs regarding stability, sea damage control, strength, a ship's power requirements and dynamic properties, maintenance and supervision
nb: gjøre rede for militære og sivile fartøyskonstruksjoner innen stabilitet, havarikontroll, styrke, skipets effektbehov og dynamiske egenskaper, vedlikehold og tilsyn

source: The cadets will receive an introduction to basic principles and rules for the use and utilization of air defense systems.
nb: Kadettene vil få en innføring i grunnleggende prinsipper og regler for bruk og utnyttelse av luftvernsystemer.

source: Expected learning outcome for the Bachelor’s Degree in Military Studies with Specialisation in Management - Naval Power and Military Navigation:
nb: Forventet læringsutbytte for Bachelor i militære studier med fordypning i ledelse - sjømakt og militær navigasjon:

source: Internet Servers and Internet Applications with Javascript or PHP.
nb: Internett-servere og internett-applikasjoner med javascript eller PHP.

source: This is achieved by applying the cadets’ experience of their own combat arms and by aggregating it with a greater understanding of contextual factors that will affect military problem solving.
nb: Dette ved å tilføre kadettene egne erfaringer fra eget våpen, og ved å tilføre en større forståelse for kontekstuelle faktorer som vil påvirke militær problemløsning.

source: The bachelor's thesis starts with lectures on methods and practice with the teacher.
nb: Bacheloroppgaven innledes forelesning om metoder og øving med lærer.

source: Military technology and innovation
nb: Militær teknologi og innovasjon

source: The course will primarily use Office 365 as a learning platform and is thus available to others outside the Norwegian Military Academy.
nb: Emnet vil primært benytte Office 365 som læringsplattform, og er dermed tilgjengelig for andre utenfor Krigsskolen.

source: select and apply theoretical and practical management tools, and reflect on own leadership in order to predict, master and exploit changed assumptions and situations.
nb: velge og anvende teoretiske og praktiske ledelsesverktøy, samt reflektere over sitt lederskap for å kunne forutse, mestre og utnytte endrede forutsetninger og situasjoner.

source: Document and report on the work in accordance with SKSK guidelines for Bachelor’s thesis.
nb: Dokumentere og rapportere arbeidet iht SKSK retningslinjer for bacheloroppgave.

source: Manuals for Kongsberg Neptun engine room simulator model MC-90V og WJ-22.
nb: Manualer for Kongsberg Neptun maskinsimulator, modell MC-90V og WJ-22.

source: demonstrate knowledge of technically relevant software and has broad engineering digital competence, including basic programming skills.
nb: vise til kunnskap om faglig relevant programvare og har bred ingeniørfaglig digital kompetanse, inkludert grunnleggende programmeringsferdigheter.

source: explain the energy conversion to the propulsion line and the interaction between ships and their propulsion systems
nb: forklare energikonverteringen til propulsjonslinjen og samspillet mellom skip og framdriftsanlegg

source: convey knowledge on transmission and digital signal processing.
nb: formidle kunnskap om transmisjon og digital signalbehandling.

source: Management and operation of diesel engines on simulator, slow-moving and fast-running engines with associated auxiliary systems.
nb: Operasjon og drift av dieselmaskineri på simulator, saktegående og hurtigløpende motorer med tilhørende hjelpesystemer.

source: Electric shock, grounding and voltage quality.
nb: Elektrisk sjokk, jording og spenningskvalitet.

source: Analyse potential future challenges for leadership development, and assess the implications for the exercise of leadership development.
nb: Anvende plan- og beslutningsverktøy i utøvelsen av sitt virke på tropps-, kompani- og bataljonsnivå.

source: provide details of key phenomena and practical applications in electro-optics and microwaves (waveguide and radar)
nb: gjøre rede for sentrale fenomener og praktiske anvendelser i elektrooptikk og mikrobølger (bølgeleder og radar)

source: This will provide the cadet with basic soldier skills in the fields of shooting, military medicine and single combat.
nb: Dette ved å gi kadetten grunnleggende soldatferdigheter innen skyting, sanitet og stridsteknikk enkeltmann.

source: In the simulator, the teacher demonstrates the method before the cadets explore and test it in practice under supervision.
nb: I simulatoren demonstrer læreren metoden før kadettene utforsker og prøver den ut i praksis under veiledning.

source: Military sports and training (MIT) is taught parallel to the course.
nb: Militær idrett og trening (MIT) undervises parallelt med emnet.

source: In order that the course be close to practice, examples of Norwegian and Russian army materials are used in the teaching.
nb: For å gjøre emnet praksisnært, benyttes eksempler med norsk og russisk hærmateriell i undervisningen.

source: The focus is on ECDIS, ship handling (helm procedures), planning inland waterway passages, teamwork between assistant (chart reader) and navigator and simple optical navigation principles such as heading and positioning, specialisation in using the pelorus stand and bow, control methods: heading, passing the half point and positioning methods cross bearings and four point bearings as well as using a watch and maintained speed.
nb: Fokuset er ECDIS, shiphandling (rorprosedyrer), planlegging av innenskjærs seilas, teamarbeid mellom assistent (kartleser) og navigatør og enkle optiske navigasjonsprinsipper som stevning og posisjonering, spesialisering innen bruk av peilesøyle og baugen, kontrollmetodene:

source: convey electronics, computer and weapon technology knowledge to different target audiences in both written and spoken Norwegian and English and contribute to highlighting the importance and consequences of technology.
nb: formidle elektronikk-, data- og våpentekniskfaglig kunnskap til ulike målgrupper både skriftlig og muntlig på norsk og engelsk og kan bidra til å synliggjøre teknologiens betydning og konsekvenser.

source: show the will and ability to link the course to its own, long-term leadership development.
nb: vise vilje og evne til å knytte kurset til egen, langsiktig lederutvikling.

source: apply tools and techniques for vulnerability mapping, penetration testing, digital forensics and malware analysis
nb: anvende verktøy og teknikker for sårbarhetskartlegging, penetrasjonstesting, digital etterforskning og analyse av ondsinnet programvare

source: The course shall develop the students’ understanding of their role as cyber engineers in the Armed Forces and for the management of av Communication and Information Systems(CIS) and cyber operations both at home and abroad.
nb: Emnet skal utvikle studentenes forståelse av sin rolle som cyberingeniører i Forsvaret og for ledelse av Communication and Information Systems(CIS)- og cyberoperasjoner både i inn- og utland.

source: Apply professional knowledge and actively participate in an operational planning process with a detachment, for deployment in an international operation
nb: anvende faglig kunnskap og aktivt delta i en operativ planleggingsprosess med et detasjement for å kunne deployere i en internasjonal operasjon

source: correct all courses for fixed and variable errors, including gyrocompass defects, deviation, magnetic variation, drift and leeway.
nb: rette alle kursene for faste og variable feil, herunder gyrofeil, deviasjon, misvisning, drift og avdrift.

source: exchange views and experiences with others with backgrounds in the subject area and contribute to the development of a proper practice in the subject area.
nb: Formidle og presentere grunnleggende fagstoff om ulike rettslige regler og prinsipper, grunnbegreper, problemstillinger og løsningsforslag, både skriftlig og muntlig, individuelt og i grupper.

source: The course will provide insight into the RNAF's security culture and what the basis is for developing and safeguarding education in such a security culture (Comprehensive Debriefing).
nb: Emnet skal gi innsikt i luftforsvarets sikkerhetskultur og hva som ligger til grunn for å utvikle og ivareta læring i en slik sikkerhetskultur.

source: Casting and welding, qualities and control methods.
nb: Støping og sveising, kvaliteter og kontrollmetoder.

source: Pressure hull and pressurized containers.
nb: Trykkskrog og trykkbeholdere.

source: Scientific method, epistemology and inference theory provide a basis for critical thinking.
nb: Vitenskapelig metode, kunnskapsteori og slutningsteori gir et grunnlag for kritisk tenkning.

source: Introduction to the officer as an educator and mediator.
nb: Innføring i offiseren som pedagog og formidler.

source: The course provides the cadet with a basis for conducting and leading maintenance work at sea and at quay.
nb: Emnet skal gi kadetten et grunnlag for å utføre og lede vedlikeholdsarbeider i sjøen og ved landligge.

source: • Vector algebra and vector-valued functions
nb: • Vektoralgebra og vektorvaluerte funksjoner

source: The cadet is further given knowledge on manners of operation, design and characteristics of cooling and air treatment systems.
nb: Videre får kadetten kunnskaper om virkemåter, oppbygging og karakteristikker for kjøle- og luftbehandlingsanlegg.

source: describe the history and social impact of the field (geomatics and military geomatics)
nb: beskrive fagfeltets (geomatikk og militær geomatikk) historie og samfunnspåvirkning

source: Section 3 concludes with current security policy challenges and the role of the Norwegian Armed Forces in the handling of these.
nb: Del 3 avsluttes med dagens sikkerhetspolitiske utfordringer og Forsvarets rolle i håndteringen av disse.

source: The course is structured as a joint learning activity for both specializations (MilAnlegg and MilGeo) in the engineering program, and consists of the following three modules:
nb: Emnet er bygget opp som en felles læringsaktivitet for begge spesialiseringene (MilAnlegg og MilGeo) i ingeniørprogrammet, og består av følgende tre moduler:

source: Shallow water effects, simulator and model testing.
nb: Gruntvannseffekter, simulator og modellforsøk.

source: Military bachelor's degree or relevant civil bachelor's degree (180 ECTS)
nb: Militær bachelorgrad eller relevant sivil bachelorgrad (180 studiepoeng)

source: Each semester ordinarily includes approx. 15 teaching weeks with 4 hours instruction/lectures in plenary per teaching week, for the most important courses of the course’s curriculum.
nb: 15 undervisningsuker med 4 timer undervisning/forelesninger i plenum pr undervisningsuke, for de viktigste delemner av emnets pensum.

source: The course provides the cadet with experience in operating this type of engine on engine simulators and in the laboratory.
nb: Emnet gir kadetten erfaring i å operere denne type maskineri på maskinsimulatorer og i laboratoriet.

source: The course must coordinate with the simulator office for carrying out the simulator training.
nb: Emnet må koordinere med simulatorkontoret for gjennomføring av simulatorøvingene.

source: Self-chosen project litterature (200 pages) Form of assessment
nb: Selvvalgt prosjektlitteratur (200 sider)

source: share nautical and operational knowledge with different target groups both in writing and orally in Norwegian and English, and can contribute to highlighting the importance of technology and its consequences for its operational application on the vessel.
nb: formidle nautisk og operativ kunnskap til ulike målgrupper både skriftlig og muntlig på norsk og engelsk, og kan bidra til å synliggjøre teknologiens betydning og konsekvenser for den operative anvendelsen av fartøyet.

source: The course is coordinated with MPN, the Vestkyst exercise, the ECDIS assistant course and the Stadt exercise.
nb: Emnet er koordinert med MPN, Øvelse Vestkyst, ECDIS assistentkurs og Øvelse Stadt.

source: use knowledge of technically relevant software and has broad engineering digital competence, including basic programming skills.
nb: vise til kunnskap om faglig relevant programvare og har bred ingeniørfaglig digital kompetanse, inkludert grunnleggende programmeringsferdigheter.

source: describe key concepts and methods in transmission and digital signal processing.
nb: beskrive sentrale begreper og metoder i transmisjon og digital signalbehandling.

source: What limits the effectiveness of UN peace operations?
nb: Hva begrenser effektiviteten i FNs fredsoperasjoner?

source: Use of relevant software will be included.
nb: Bruk av relevant programvare vil inngå.

source: The second part of the course (3 weeks) will deal with the implementation phase of a joint operation.
nb: Emnets andre del (3 uker) vil omhandle gjennomføringsfasen av en fellesoperasjon.

source: identifying, planning and conducting engineering projects, work tasks, experiments and experimenting both independently and in inter-disciplinary teams in the Navy.
nb: identifisere, planlegge og gjennomføre ingeniørfaglige prosjekter, arbeidsoppgaver, forsøk og eksperimenter, både selvstendig og i tverrfaglige team i Sjøforsvaret.

source: Loading, unloading, determination of light ship displacement, weight calculations, free surface effect and damage at sea, stability when docking/ running aground, presentation of GZ curves from lines plans, dynamic stability.
nb: Lasting, lossing, krengeprøve, vektregnskap, Effekt av fri væskeoverflate og skade til sjø, Stabilitet ved dokking/grunnstøting, Framstilling av GZ kurver fra linjetegning, Dynamisk stabilitet.

source: perform function tests and troubleshoot security, automation and monitoring systems.
nb: foreta funksjonstester og feilsøking på sikkerhets-, automatiserings og overvåkingssystemer.
